{"architecture":{"class_name":"Functional","config":{"name":"sequential_1","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,1,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"batch_input_shape":[null,1,3],"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":10,"activation":"relu","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":1},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":2},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":3},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2},"name":"lstm_2","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"dropout_2","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null},"name":"dropout_2","inbound_nodes":[[["lstm_2",0,0,{}]]]},{"class_name":"LSTM","config":{"name":"lstm_3","trainable":true,"batch_input_shape":[null,1,3],"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":10,"activation":"linear","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":7},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":8},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":9},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2},"name":"lstm_3","inbound_nodes":[[["dropout_2",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"dropout_3","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null},"name":"dropout_3","inbound_nodes":[[["lstm_3",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":4,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dropout_3",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense_1",0,0]]},"keras_version":"2.10.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[1,3]],"output_shapes":[[4]],"tests":[{"inputs":[{"shape":[1,3],"values":["1g+AvoYFFT/ynnm/"]}],"outputs":[{"shape":[4],"values":["AGFFvGRSz7w2Eow8pio4vA=="]}]}],"trainable_params":{"lstm_2":{"weights":["9SKWvW+for76YK++bluRPhl7qD6f/b2+wLrOvPDoBD5iG4C+e4WavgxvOr69xK6+iOO2PngNt70HcIK+RikAvsBJRD3YPZc9uDV2PSjRmT72w388HmqEvujvwL60YXc+RHg9vll0ob6E+ra+NZHpPlepg7zxZDq+XYAEvoAIfb73BoU+/vkQvg+qsr5TGIu+xKmBPn+t+j5A7ik+qVGfvFWVH7+CVIq811eVvhQTsz5x9lg86LWdPbASkL48HbY+Dq4UvpNlib7krE4+BJ2YPsgldz5A/p48LcCEvmOUuL4AZbk+ql2KvnLYvj4ki28+jjmmvlc0eb2SKiK+rGTTvRlg+DzRFo29dBW/vYvPJb4uNp0++y3QvWeBeD5t/Vy+zfJWPtLAsj61bGc+7i9lvjiCCL2JRu48r9v1vcoOhr5LlF68fZimvqB62j00krs+CBjRvt8cWz5M2IW+Vvm7vI2uhr77cdy9xA2FPSxSOD7FNa2+XIZIPsBAz7133zW+OPE2PlQqtL0pTA++UMubPQmCNj3q35a85jyNupg4o73I8ji+G2cyvftLor7vI5c+Md5WvpUhlT5H66w+LNgdvvxpNr1wcUU+K2a3PmaVt7yQlGa+5GHwvYznQ76ScCQ+"],"recurrent_weights":["gDeCPOnJvL0sLAA7n5rjPu1OfL5aOa69LqE7vLFtKL42ssU9sjdKvsy2ejybgAE+ccDqvSiBab5wgEW+RyOevdLCOr7/MOA9FVPMvUizjL2ndNk9yCbIPUpO/jvWGVO+wiGVvou1tz6K/B8+haosvne6Cr5DX+M964g9vRxyL71+Ob+9fqtEPXiu571uEvQ7P+rsvTSMaLnpdSq+4BhDvhacHD3SgZc+ZgDuPQT4ZT2SpPq9F+zVOwJBHj7J1So96+YGPofWg74GJVQ+zQbWPs/u4r2qwqi9nkEKPkqGJD14LNW8TNEvvQzTNr4A7JQ8lcw/vhwQA74rqSg9TlLFPgssGb12QoW7U4OgvYu9A74fqNk9vRiOvuoJBb5Ke629zH69OooLn75U8M479gxcPaKMGD4j9cu9AAmgvYGsXD3WTtM8xX82Pj5ACz5St0C9l26RPALhNT3SGk0+VDHovO6Wkj7ZT5s+mlJwvmqQhT5l5AI+1rjUvXzy5T1+UwK8nZeIvsgyjz3xRDC9fSTJPciM0LwhUlu+3aR1vkGrt73hoLY95eGxvbRxmj6KQwO+6DE5PgXqEj72wBE8hUljvkVHGby5BnM+o/S4PZU4yLzpcHu+6S7EO9Ekmz1Wm889gu68vK0c8z2t1rE9JPcSPjGmVz704h+9mQvOPU+Tiz7PdF8+IoOTvvV7Hb4lPby9uOSUvToZdD7HGCk+Yy6IPXj7i70ucY0+CGC5vcAw+70M7gS+qocLPf2aGz5icSe+jrAdPAekt72Ouii+e1+pvRJqm75wIi8+KJ0SvugWM71EOYY+4NeEPiPQVr0YK+c9voTpPWR8D75tRt28a9UpPpcwej4QORK+HaljvC6IH75gQwe+fLKqvBfQuTxWVGA+VEs0vml5QT0QA6e8SJEdPgT+8j3N1wW+qmhHvTzVL7w2Xcw9L3CrPftx1DzstZs+OD2CvvTBg73X8II9zHiLviygsL5mmry9CkOCvsBWa74gtfc6OP3OPYYEhb6+6B49","9KQavn6qPr04yTC9CbKfPYBEETuNiIA+nr5MPn8kEz6V4Z68sSkQviKi/DzM7VA+gFHXOYEjUz0hNBo+jdWOvO2aAr6zDGk9vPmgPoijVT5UHxa+OSfoPDKH9LwSWgK9EqUpvbBzfr7UEMc9Q1oEuz1DyTxJKKi9m6yJPNITi7xOEyw+VHHEvsWtGr7hdoS+ZWSIPfsu2D4cfI09TTGHPnt/6LpPsvw9iNybvc7vPb40vuk7SEBNvgvxHr7qnU29DBIXvexzZj6axCQ+vhg+vq2JojzcdR0+aBhUvhrpYT2zk609OIQdvOjNgj1URVg+PdAnPt7+Az6Jh+G9zxFIPRLAYz7vqiM+3WaQPlVG3bzG9nC+b6iFvD9UD76cSpO9RII+PdpYvT2BqjY+7cysPehIJr0QPL09nTwwvoXROz5qIEi+43QfPjHwxL2nRoc9GYxFPnlPP71gDn+++n/RvtbxCr7uf2K9rWzrPXZfhD7b7Ak+EinsuxiAjbtCrVM99SWOPYgcQz5tpyI9tJG0PbTMIT6FwFM+SGMvPrzl6rxov/m99qmIPCQIuz1wPIs9Bm8BPmS9tz30iY4+Wq/JvWAOhTvDJ1895qKnvluQ1r0rdZE+c0rYvcw1xT3CZBi+1PmAvXfUsbzKm34+TWWZPsDaCz133+o9yPI5PRX81L5ZdjY+fX59PtUGBj7r/Cs+IRxhPqwaKD7aFwE8rw/evWn3Zz6kDVW+e7YBuw5QTb56TrM9VJoJvIoDDb4RCOs9DERfvoAqHr6GYk08lwQvPoticr2FqpU+f7phvloVNz1dqsG9Ht1bPdzIaL0164w8GOYaPhDQLz79tQA+2RGtPqOfEr4cBKa9/IcLPi60Cr3jQTA+XREUPq48ZT7zNvU9QJsmPp19N70CWLY+RtQnvVcsQ76rY8K+2z9tPTXIZr7FxIa95MJZvkKvML1QMY+8ricwvTrKlbxs1II9z23NPYzbrjxEDaY+uBusPbdtpj10sBW9ItKjvPS3jz1CCAQ9","1D5YPUhNJL6ghAq+aTfyPRxD4z20PUq+o/SlPkNwSj3i/GK+aVSePi5pmr3iHDe+fgDnu3BULb0RqLc9vk0YvQ=="],"bias":["P4LavJQQJTvGDg89AAAAAC8uKL2sKhY7XrEEMHjwy71DRwQ+J/E3vQAAgD8AAIA/AACAPwAAgD8AAIA/AACAPwAAgD8AAIA/AACAPwAAgD/07Jm95eVvvcSum7sAAAAABmCgvRkahbwyvgow9fqqPR3MbTzTPkK9hE7cPBT4H701o847AAAAABOP+beH4EG8WbAEMNQSdT5Z0f09eImHvA=="]},"lstm_3":{"weights":["USJivgylpL4LNmi9mq67vKkJiL7Ri3o+qlkAPdZY4D1zhqq+i4AcPj8Rr77QFIg+1FOZPeP5jL4o12o+gEf/vJQrmz6k5x2+74orvp42qz4ip5u9bJrPPM29Gz7XTcc+0EmMPUmxNj4uD2O8yF7SPcS9Bz19oRm9I/+bvncEjD5/Gps+wudavhNJQL1iUDe9O3+tPZv38L0bd/S9/vJGPVxT9j0KszM+V2iavmy+tj4tRDA9bdSAvp3ZCj3ODfq8lnWDPmkRu7w0ANa9ugnWvbgP/T0QIcU89EiDvgxgl76A3Tc8SPxwvUKjlT6A5Bk8hWOkvdXqfj7TpPe8DlttPv+k1T2tGXo+ES0zvQ1/1b0WcKS+kAuFPvc3ZLw16g+9tsaIPl2V272PmSK9UruHvg+7Dj1oOCe+OqqPvtsujDxWCFw+6YX0PUHhZD0tlfW98Kz8vYVNq77wNr69s2YhPgAJvz6VY/E+S3ewvvpvob7gyu49bFXzva4gsT4mXhE+mJPmvfRHPj7y1oM+AOJQuma6vD6P/zg+pR/fvtnhOz7fBDi+6mhOvn8G0j1iUrw+yECHPlSQJz896AW+tWeqvgAKsL10l2g+2N9AvrDnjr6VuHa9EKyjPTN/vjwn1ds+YCVsPDBjaT3QZR69nNK3vSx9mb2wASA9GOqBvnyEaD420g0+qEuOPsvSQb4Ak4c9XtwqvqrYEz6C0As+ODoxvTAeIT4ZjJq+Qo1svkjgpz64yCE94NivvI1hTL64138+nDUUPktMor7uEa++7HX7vQYclr5vVQa+qtqsPviiqz6YWQ0+uNcRvqDCqr6gADA9qoRzvtQo0j3UAo4+slYEPrYwvTwN3CQ+JzfdPKINQj56uvQ9LWA4vqPfFb30slo+P3xOvg2GybwJ7wO++KMwvijbbb7k+Gw+EAN+vYBiRr4QjqK8jTRmvjCuybwrmbC++46JvpcXgD7fbPw9BGQMvks2RT2IZFw+EqeiPfkvDj5ER4C+SKWNPYzLSr4s7aW+","dWCbvvmcob3g17G86cSTPaaSPD5gZxa+hOiRPQAwIz5z8Ym+I0vzvWSjtz4W4Jq8SuyHvcqnyz0It4y9GkxUvHp0kj7SIQo/oOL1vRhbgL4hYDO+nJd8PkD2dj4Yn+w97FaYvi/VIL4gATQ9rfuavuClZ77pwig+OgBrvpfxTb4pyaI+vY2oOMMplL561I+9ekWFPqXo/T7p2T89Oai6vhqki76niSI98ZviuxwcUz6vToy9loTLPfivE76a3wG+UDcoPlj+cD6uBam+6OZpPnA4iTzjRUu+0FMYvXbVj77UNYW9oqapPhAOoL60V2q+eEySPhi23T0sirW9YPAHPQitRT6TwR++iJ8ZPlMPhL7Yenq94xU7via9nz5IbAq9rP1LPt0erL7OYhI+4MogPZCy/TwAb+68ecWIvgDHMzxxHD6+0c+kvvBV173taBu+QGvlPSCYZj444pG9vHKMvU4mbT6ixqy+sZErvQMdGz9J2Ik9KGaOPsfJ5T6C3Js+BF1JPfO2qr30IOE9/OeRvdKq/734JHE+vtCOPkEXBr6Aqa09DLFPPpXErr7AImC+jbnWPv7bm73Q/yw/wZlAPT/3WD5Zg3k+SDE+vrhNg74aGom+38P3vW4ZEj59igQ+G8P4PpDi4jyTBxu+1M0LvuQJDT9nZrc+hBlwPOmIMb4Troq+7WswPV5RkD17v6M+1IB6PpHxgL17ny8+XcKjPrqkNb6zi+87UIvNPWhdhb0e4S6+0JCovHRDib2AFqI+vuZjviS3jj6Wg5E+vEJmPvf1s76EPsG+NOqHvrAv9r4e2W69W9flvbVW1T2DQoG9+i+VvGG5sb5bQ02+iVGZvrHlwL1uwEk+u3znPapvvTwu4iw+r4JGPABIhb7rMYa+NcmnPf+9072CxmG+e0R/PmOblb5jZdM9/AoWvoNWWD2HSzO+fcu3PpabBj7pKBK+NmwAPrAkjLyA+xu77HedPfhnYT2GMw8+LLVvPuDHmD6GtDO+fE2yvsBWID0A5B0/","Cs67PRXduD0bBy0+TVZAPlFckT77MA09nmn3vVEyHj7czfa9eQa6vZrrBT6yVYW+QtDLvt1HHj3ZyUk+B/V7PQ=="],"recurrent_weights":["wHX9Pb12OD7n4wW96k8ePrB2kD1AM0i+OxWbPuyT9b1liRC+pv6MvbLmFb3RP4E9/l0Dvul9cr6kwtk+AOidPUGvyDyuxiO+bUaQPiCE0Tx/ZB69Tu/hvZ/WEb1Aowk+FgaivOioDz7wQUu9lboEvrznLT49LVo+cFyRvoEfSL5tH609GxcTPvCqtb3RXBO+cF1ePorScb1gfK+9Nw9SPUl6tr48vIM+efEGPYgzhT0tZo89ks2ZvspENL6Bxfc8WHF0PNF+iL1UEqS9PNebvT/vnL2IRiS8WFCtPI3vkz6aDgw+QLxvPvMhzb0/8jS+C8WYPuakXD0I/7O6XtiiPWR3VL6+I2K+CKgwvZIZUTx/CEa9qPQRviAAGj6VPpS92fzyPRWImj58rwS+TGrhPWyaDz6eYpq9wQkRvkybMz4KnG0+JZzlPXB2gT6UZ1E+bZD7PWirBL4wYT68IAwyPuS/+70x9IU+XUw7PjU4ob2mr1M+gWa/vci1m7681e49IbTqvap8AL75Ads9BB0NvsQ+f76Q62G9zFHgPXs4jj2KMuu9l4odvl8Vir5V8yw9GnMGvkTASj4IoV8+EMamPUwn8D14apE9NtAlvu/1772GrA8+POwiPsdzvj24LcK9K8ikvIjtFjwjXi68siGNPDJT6j1PkJ69R7V2PhXj0z0dp9k+XgQTvhOSbr37zEu96+glvmcA27uREPs8jEyAPVW9pj0Uwgu9StY8vgGe1b2aZuo953XaPbKOjzwqgi+9Q2UYPmwFXrx9J3m+b6oRvk8Y3z1sidE+2hs9Pu1siz2Q4sQ9VmSGvmXKLD4+bIg+zt8lPryMsjwtw4Y+suFFPFVhCT5dvEe+v0jCvLBtJL5536C9h9tQPlZ46bxFr4Y+NJsCvqBujL5EEgY9Df9BvX9rDL5cJN69alX9PbgleT7GreI9/CtMvo7Jtj4Ivbe8wtvqPeAQPzqn/j4+xJr4u7nk/jyGEeu9Tc2Du/yf3737ulO+CmzyPa/PJz49t509","JicdPQ8aKD4C8aW9Gv41PuA5xb5j4Io99zWdvBVwQz4YOJg+BpKCPT2Xob7iZ/S8alqEPHzgXr4QhtQ8FWLfvXxXgT6Iokm+y/Y+PkHf6bwSMJU9wVfEPYm8Nb6emFU9eWA+vt6Qmb3Akwu7WJIwvsHxqL1Rrb29JoLGvczcjL3PUU2+VAaYPld9rD713y+9GkOUPDTDHbwGMS4+buSWPdRmEj54QKg7h8WQvoFH2j2d/nW9UQNxvh+tYb1Ae7k920fvu+ebuzvytno7oIzLvb1woz7ttCY+O8Qyvttllb1WTXc+apAkPkvsoT35oXc+VElTPjhfID3feJK9k7s6PgW6mz0oVDE+V6DLPpzsOL7tXQE+mAgXvqoNXr4H/aA8SKTLPeZ0lD6QmW2+o+IBPnZwxz1Augm9ZN4AvtX6jb0LhBo9j1cYPiZQKz4ohQY+9uDZvaINDz3URJk92oXXvN4nFb3wRwG+t/jyPUyDDj3Q3Wk+PoklPe0mRb5gyjC+hHQsPSCChb3QZ7C+XWy2vR5QYL3QbGa9dmsfPWq5yTrFG0S+AFsEvVXfjb7yyYC98546vahXHj2MvOw9I2uAvh57n76qYlQ+A+ebvqL2VL3bKaG9TupbPnu7VL44Y5K9BvoTvGIZVT0WyT++o3XvvZs2sL6Pft68g64TvSf6ArygypI9DjyEviGNCj6eBOc9c+dCPkyh2zw3q3K+WyE2PoTWrT7W1JU858rFvTn1Yj50kqM9C0i6PLB60j2QZGU+6GNaPlhvmL47q8O8bzJpvZ30F77q7DU+jMpLOnkPxDxCsya8NhKGvaJDGz54riq+zssiPR3fIr40Urm89gBoPG0+O75ZyCC+VhluvQ0vYb4FuGw+bVOivBjBjb6FI/89JAMUPrleGT7ZvRA+59OBvoc2yz6NhpC8ReMAPd+b9jwHoJK+TI2cPFsevb0gK3M+dMG2vVVDOr68Bhg9MjiYvS4CHz5nLFA+kNo7PC2sLD5pMIu98SO2PRddNr602si+","XTjivKrlH7yKqwc+wIgLuqxXQr3j9Z08UpZ5PrTvMT6QnAM7hEKGvUC05DqO5rG9MvOfPRn2VL4J9Bc+YXk1Pg=="],"bias":["nmyGvTwx3724YNY8p7RxPMAoVL3AfwY9w6PHvZnkHL2gnuw8PGS9PQAAgD8AAIA/AACAPwAAgD8AAIA/AACAPwAAgD8AAIA/AACAPwAAgD9vNrQ8Wf1+vc/DQTwei3q8bSAZvVt1IL651Gq9O4YyvMJroz3LZX29lYKPvbWCEr6QEIk8Lgl4PRbLB74u6lW9ykPqvWjeaL068wu9rE9dPg=="]},"dense_1":{"weights":["ih0QP4sPFT9Jr1G+dU0uPpmn5r4nDA4/LRg1voQ2EL9Cd8S9Qh4Kvr+c5r4lxci9FBJ/vBwOIT0zGtq+mSvvPplWAL/YPry+MlbovgE3i77hda8+D4LvPjkt+z2IP6A+hOdBPlCe4r5Mvc097V3PPf21Wz15vQK/rOoBP8YB1b7UuQe/nP7svsLqOTu83J2+f63VPlZZhT5OUc4+Bh1NvQ=="],"bias":["P8ebPORB4Dy3h5k8lOKmOw=="]}},"hash":"f3a362628aeb2574a8cdba152dcc4e97a2e8c0c1a8580316987f4b257d2f2ce2"}