{"architecture":{"class_name":"Functional","config":{"name":"sequential_6","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,1,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"GRU","config":{"name":"gru_12","trainable":true,"batch_input_shape":[null,1,3],"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":10,"activation":"relu","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":1},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":2},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":3},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2,"reset_after":true},"name":"gru_12","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"dropout_12","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null},"name":"dropout_12","inbound_nodes":[[["gru_12",0,0,{}]]]},{"class_name":"GRU","config":{"name":"gru_13","trainable":true,"batch_input_shape":[null,1,3],"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":10,"activation":"linear","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":7},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":8},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":9},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2,"reset_after":true},"name":"gru_13","inbound_nodes":[[["dropout_12",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"dropout_13","trainable":true,"dtype":"float32","rate":0.2,"noise_shape":null,"seed":null},"name":"dropout_13","inbound_nodes":[[["gru_13",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_6","trainable":true,"dtype":"float32","units":4,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_6","inbound_nodes":[[["dropout_13",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense_6",0,0]]},"keras_version":"2.10.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[1,3]],"output_shapes":[[4]],"tests":[{"inputs":[{"shape":[1,3],"values":["gregP444Jj/hgnc/"]}],"outputs":[{"shape":[4],"values":["Gv9YvRXmZD79tXw+YTTcvQ=="]}]}],"trainable_params":{"gru_12":{"weights":["JJKCPYJDPD4GtpE+1zIwPg3ZG70FEHa+6U/hPhvA8zzwHKc+usWFvoCQf7z+uog+DAKjvXZct77tI7U+zhGvPl39JL6VKHE+IiMVvdjjRD6IUIY9v4jHPhDURD3hJaI+zqaovBTckL3Y2Qk+Kr9APj/cFb78t7M+JPRsPnXWJL2Uvrc+oSDNvttMETyApz87oBTsPT8grj0H2MO+MtSsPgRmL779f9A8mZU9viMR8j0cXD8+qNMDvSrQcr1Mgcs+YVXavpJMkb4YmH69XHBiPRRPmL7o7mU+yyGvPhpUBr6pCiA+RITCvqsyN77iSJq+9F/NPincMj6KK9i+xxbYvkkEzzw+Ics+AtCHPuRb7Tyoboo80N0WPq67lT7aoIM+MNhzPsHyNr4cpSQ+AJ/VvUuUnj42ONw9E8abPNhk2j24Dii9BFmAPcx3Wb7W6jq+AhIhPt/Nvb6Y1L+80HuIPihgXD4wN2C9"],"recurrent_weights":["gHfEPYo37z2fuY8+5/e9PevQKz3G3586Vo++vKXX173yrrG9xVyVPNP0iz3MmDo+wNBsPg2U8r04OUu9cZQAPznzi76QRiA+QjEHvk19hz4DTIK9CuogPlG1nz4jmx2+PFn7PaWJjj6rHGG96J3VvQD3Vj1XPoA+qQK+PbS1hL6PjjK+zrMavFJENr2es/y8M+jZu/D3Pz7hY6o+qI3rvVYYFr5llTM+OjOwPtTOtz1CU7s9A8+UPkJ7Rj6nDDA+xSeRPtvgB72VA7U8UKXwvYOpRz5AhEQ8k/OiPualh74FDFS+CwKVPQaMA76RsRq+z2JivujbWbyoWGY89OI0Pr0Zyb0gaiA+6QIhPjeunzzwVlO93GxePOr5HD4C21W+xkl9Ptu+UL7KYEa9SZ8WPk745L1Qap89c/fvPgf+ub7vTEA+swdlPbK1gL5Aczc+P37aPblVhD4vN9g982g7vcSJhT6k2II85Uv2u0qga73R+X+9Ga+6vlXYbT64VR49G8/qvQ2Gkj4R5Qu8y8RDPXecxD3SwSc+kHk+vrbfX77S0KM8s6DzPeiVUb5YF9a8QhXgvcR4yL3gUO09jObFvg+IPjvDxrm9PeFrPvbsej7jV48+b2S1PgJz/zzsjBO+XG0IPuHUMLwxnD8+C+ZJvErfE7wHqpS+zkNnPX1xzD6wy4i+X6hdvpUOvDuEPyo9kEzKu4IyuT3Q9sO+d28Cvi73o7zoxSG7rQ0NPRUvGL6NYik+4AravcTxqj6pWCI+ik9Cvki2vT0OSI++0ZLfvY3iWj5e7S++85Ftu/s+ez1lfgm+HdloPqFJAD7kM5K9fsvfvgKTfT1mUjE8oXpKPtaPwj3CrbE9QyYoPrPKKz6IvUK+c22kvKRdn77IqnU9dn87PkU+qT5sTmE+4AZUPFp5Ar7hjUA+LcRpvl3Tf77LoqQ95q2ZPjUYrT1COyg9vAedvCXeqL4/pT29lk1rvVEhCr0eHwk+j/0ZPkfkgj4XYd27zBiIvQ2RNz3ygU4+","CCafvoXMaL7djKQ+OdxuviaaM74hQ009xNSHPgotoz6yD/I9MOLIPgD87j28T789/bgkvUfAiD2yc9y9VfeKvBrzDLyntt09ai2kvfYDNr4yk/W9Is9uvut0MD5rUcq+zisUvYhsOb2avEU++8eyPs2tQT5Dqoq+t70HvlpQur0bXfa9esIWPhjrez2erSo+OReCvQKFMD1Na5u+FRhNPgQDxr1uxWM+iXsXPR67BT6ymaO+ky0cPaG7Bz7kJ5m9asKqvb2WHr6Lr249Rq4aPniO7ryokbW8deH2vSuIPb4JY38+9OKrvbqCAj7qNIY+SyOKPUiErb6fC4q+QAG5vYSFKb2X7/m+hMhbvlgvT7y19oM+GsWDPeZXOL5e84E7CEw/Pksnpjwbipe+u0KWvUrexr2qzdm9rSE8PVRELT6hHTk+piHJPQyS9b2cyhI8VbhgvrbK870MXVE90+iMvq0XZL659o2+V6mlvmLjgL3w+PE9N4VuPp5QAj1+DlO+J51ePu8wYT7K1V29qrRmvpgPPT2raNo+0ORdPeqnNz7L3+O9FdcIPqtQH77Q8jW9"],"bias":["AAAAAPQcsjwAAAAAtjiVvF2RIj0AAAAAWpvYvfBkVz7+utW9AAAAAAAAAAB21og+AAAAAOwCAz7G6f0+AAAAAA2RgD39jyY+I8FAPwAAAAAAAAAAXkH7PQAAAAAOCWe+XU8EvgAAAADweoK9UtqZvcZzyLwAAAAAAAAAAPQcsjwAAAAAtjiVvF2RIj0AAAAAWpvYvfBkVz7+utW9AAAAAAAAAAB21og+AAAAAOwCAz7G6f0+AAAAAA2RgD39jyY+I8FAPwAAAAAAAAAALizlvgAAAAAlvXC+qWL4vgAAAAC9UeK90mNUvqkOIj8AAAAA"]},"gru_13":{"weights":["eN1GPlKWkD4IVKm9AGbiuk1yVb5gJxU81BsjPqxcrL6ATL88Iha3vnCev7xQHFY9LlKYPkARcL6gPBo+CBTuvfueTr6c0Lo96DdDPvtqtr7uk6w+qOSIvtFQdr4op10+MFZsPRDg9D28CWI+TN94Pjxtub7oNzQ+NvgRPm2eBbuPopw9YcLgPsjyuD6rVNm7ZvOJPQxls77gll68JDRVvrXbrD5G6yI+YrSjvSS9TT6UOnu+FcvLPgf4VL4MaC898I62vCRAoLxsHAG+kunEvoyKf74Wdgq+fn9kvT/LqTwYpDK+ve7ePbLVRL0AwhA+EPhQPmRFAr41YKS+cMQHPcTGtb0Qf1m9DAikPtjHor2AtQm8ULE+PWxedz7ImWo9iNI/vZ6QhL6HQ3C+NquvPj4hhD4o1B++oFNKPewbAT4s9XY+wLBZPbCtHb0wtCC+UOedPg5ntD6yG7Y+v6Udvjy9dj72A7A+CbnXPmgcnLy5SIs7rQkfvpdlFjzjva4+Z2Z7PDySrD7s+0Y+oL/BPi/FKT/VkYi+j6UKPzr/BL/QSCE+IQivvmAtvT6rkr4+zc36PRFN9D6jvTK+2E6WvZiBgT6sb0i+atuIvbNRLz6ZzYg+MuQpPn3x2bwMrSs+q15QvsqeZj6LiYM9TJTFPXZGgT4vlji+XrS9PgB/TD5PnYu8QhJEvo7tVz55CQ0/PQ/KvrdcLT9RpMu+4W4/P9NdCL8Xxbc+2H6qPoB9Kr78pX2+JufNPb396725Q74+m4fYPd1kOr4rDZu+pKHyvHwNiDzaeXQ92pBbvuAcFT64jYA+gka6vjURa77K6L6+IlyuPhh5b77AoZm8oOZmvPCe3L0o8mu+AHCyuhDWoz7wJt09fAi5Pu1Svb6Mn4Y9jmPCPqeeP74YU2k9EpobvrznqT50TaG9ZehTvtixCT6QmNE9YF85vdDXnL4yHX6+sX+oPorpzT2HWDM5F84jPb6cSzzlDmk+ju1ZPqtxr74Pa8K9p/CDPiMI6z01atA+","CI0BvcuuoD7ZEvg9RwI3PlbpvL503Ya+2l4Fvi/93z29/Do+zFUivpMoMr7Kujc+1P3cvNCjWD4hoOS922PHvZfmdD0RsPG8pirWPQcTr72afJw+Ug2PvlWEZT6BI8c+KuQevhxyxr1FD/I9lbzCPseUhT72qfU+qdT6vvu3pzydVL++AWL7vSN/W77iCoU+UghCP9FbvL4nB4O9yurZu5L/Xz6/qGq9zxa8vk+YEz6fBNK9Mz0IPINEgr04toG+o4D7Pl9mXD487VM+dKVGvpOCwD2J2jK+M4ltPSxfnz4iO2s+ofvCPilNsj5rla69R78Sv/3AOr446ge/JD/YvY+B+T7kRYe+jA4MP17uHL6Rxga+RIiSPuprdz7l/Ra9CGfKvoropj3kzW0+a25kvg6g4D04xHk+gPeSvHbLmr7MR5++2FN/vUjPtT3QkGE9EBxMPdCnWT6wxhE+4GzFPHS7fD4wgsW84DwzPsbqu76gH3U9EIDFPLgOzj18mpm++CJrPuQozL3dYb2+BApbPly6fD4IsCA9TjYHviiXgr6QQ5k+TJZoPvjqHr08mpU9"],"recurrent_weights":["gBDbvVB5QD699Bo9KdiHvrp2ZLy/izO+rU//vXHT2z1E/Pa9ULzIvtLAmD1jxP29TK4nPQvHpj1SxIe+eDnsvcYUMj36UTi+zQ6vu3W4zr6NQxY9iiLdPYhb3z2M3BW78B39vPp9LD4oKwu956T4vs3obD6q6G880mVtvowg37zXUOA+ZRD3PdSkCj45dQM9dwtPvkmjTD0SPFa+aic4PkIU3z1FbYC+j1Ffvsgx9zxw9kO9v6RZPgKvYr2jAhw+4ustPc6clz6fm7u+GfPDParxwryS9so9rTtXPhvaGD5aZC6+EIFzvi3zTT2xkJU9F0E/PVmotr5voko+r4EFPWiSjj7Zer298cwkvNTdl76itCk990rjvbuQAj4yDli+l1MdvhNVtzu8Wno8i40lvkotsD2Aw+68S+oHvqNsQD3toZI+/CkNvn1wbj3xM5W+0j1aPlBFiT4dxuA+UDQIPSGEET0Xih+94EuCPh/jE73dDgC+aizxPND6GL1Ormk+3BJePU1Yaj6aeTg+0uo9vv+vAz2+aaG93UcLvn2DnT50+ko8DVYHPu4uH74TXji9+AqJPXY0Fb5iIzU8ldNFvqbxRD3SsLW9I+nAPmL5yj5So8e++FdZPkyq/7y6NKw9ieG6PhgYc75OoEg+neeBvh19Fj4a9gO+Ss68PQaglz3r8CO+2nBxPXmaYbzi9nI+KMSyPlzxCD7gq4K8jUAmPtJ8kj4ZT2U9N0ErvuDICD4mc7q9rIXUPThduj3Nwf09r00yvnXRlD5Q2AW+FhS0PfDBID6cP4O+/4YlPs4Xbj2MbEA+4CvovaC54j4iryg++dIXPlNKgz2Gmbm9jUhyPbtFhL6OG328zkpgvWZfKT2HTwm+qvtzvUmKmj65N2k+bQxsvKw3lb64ELQ9zCbuOyYJvDxTYr88PnmMPpaA4r701Li9UCTGO4m8gr3VBmA+Df7CvoAAYj1fAQ4+HIsEPsl4Qz5gDYe+8gz+PemszT7fnok+hO4VPcaGsr2l9BE+","xP1zPld6rz06eQ0+ZeRKPjHStjwoFKw9NLZGPuBxOr6ii7K96rz5vUNMTb0MNJS+y/PEPUKFwTzumTA+IKuJvBs4jb0MgY6+gMWxPSHJQz429my+lNgaPvGBrT4RK688Ag8Evvgx0L0WYFs+hr+nPXb1k73WfLg9Itguvjv2Dj4qFTG+WyA4PYqNab0rOBU+O8njvUaeRT5VW0A+Ld1kPmR7jr6fhLu+7ExbvurikTw4J3K+4P4zvufdgT6adxm+xuCTPYbchT3mMwE9WVYGPTQh0T7YnQs8EhWtvOiuYr26mwq9HuiYPXGUnD4gLnG+GAEUvEt+K72Jz2O+NGcLPox5Jr58M0u+IbWuPjhLWr6hzAW+0uh5u/RYJz4PFxA62vravnIJorwFmlQ8eoC8PnuTJL0oAZI8yNbcvcuDqr5j2gs+Wtm4vUF6lz0nCU8+VR4EvvuK/r20rxA+9Z2wvgBC7z0pCCw9XfC2PhChvL1zlxO+/zVMvnhJwL4XO0E+qik5vdrFoz2o0qy9DZmJvfY8XT1Hpay95PoEPfNxkb6pxI2+BxwavbIg0L3bYFe+"],"bias":["lt3uPbdKDj7Lq6s+k1q1Ppe/mz2a2RI+DKgHPpi9IT2I3SW7KF4CPqhZJj/LIbA+ZSoqvxXL7T6UBI6+mxXZPtnQBr83tAQ/l+ujPqvN+77fyY0+S3oSvp05ZL6MOY4+R/gLPjCCdr76Mwi+47kcvoaL3T0pn7A9lt3uPbdKDj7Lq6s+k1q1Ppe/mz2a2RI+DKgHPpi9IT2I3SW7KF4CPqhZJj/LIbA+ZSoqvxXL7T6UBI6+mxXZPtnQBr83tAQ/l+ujPqvN+77yugs/Ps18PkV4aL7F0PC+rM8CP/nHhL4JLBq+EUBhvpgPrT7FnrG9"]},"dense_6":{"weights":["ebO7Pm6QlD6k3I2+cHoXvUSa/D7rQI0+MGiKvkl3+73dOQ2+J/5DvsFWBr52z/E+Us+1vi+cI74I0qA+xVofPu/t4Dz8QpA+3SPKPt83kT51kwm9ZewJvgHrnT7pRAo+eMPvPn3XFD/X5dC+Y3j9PmK5GT8Jta29JlaZPuI+Qb45rQM/2zWxvvsbCz8FX7E+TTG2Pmgczj6wOKC+FuhaPg=="],"bias":["3U01vjG2Az4vvJM+N64Fvg=="]}},"hash":"0c7ba73e4158d8b12369866edd786fad81cfd9b8e9b2ffe07f892c9579e37449"}